export const recommendText =
    'Могу предложить тебе список достопримечательностей, событий или' +
    ' мест, где можно вкусно поесть, по городу, который ты укажешь. Выбирай!🤗'
export const tasksText = 'Что ты хочешь сделать?'
export const defaultReply =
    'Мы говорим на разных языках... Попробуй воспользоваться командой /help'

export const nicePic = 'прикольная картинка :)'
export const lol = 'аахахаххахахахах'
export const usernameAlternative = 'дружище'

//==============================================================================

export const foundNothing = 'Я ничего не нашёл :('
export const noTasks = 'Задач нет :)'
export const foundNothingHere = 'Не могу ничего найти об этом населённом пункте'
export const unknownCity = 'Я пока не знаю такого населённого пункта'
export const oops = 'Упс... Что-то пошло не так :('

export const status404 = 'NOT_FOUND'
export const status400 = 'BAD_REQUEST'

//==============================================================================

export const enterTaskName = 'Введи название задачи'
export const enterTaskDescription = 'Введи описание задачи'
export const enterTaskDate =
    'Введи дату задачи в формате DD.MM.YYYY (например 26.01.2023)'
export const enterTaskTime =
    'Введи время задачи в формате HH:mm (например 09:47)'

export const tryAddTaskAgain = 'Попробуй добавить эту задачу заново...'

//==============================================================================

export const askAboutTaskNotificationReply =
    'Может быть необходимо напоминание?'

export const enterTaskNotificationDate =
    'Введи дату для напоминания о задаче в формате DD.MM.YYYY (например 26.01.2023)'
export const enterTaskNotificationTime =
    'Введи время для напоминания о задаче в формате HH:mm (например 09:47)'

export const cantGetTaskNotificationDate =
    'Я не понял... Поставлю на день задачи!'
export const cantGetTaskNotificationTime = 'Я не понял... Поставлю на 08:00...'

//===============================================================================

export const enterCityName = 'Введи название населённого пункта'

export const enterWeatherNotificationTime =
    'Введи время для уведомления в формате HH:mm (например 15:48)'

export const ready = 'Готово!'
export const added = 'Добавил!'
export const tryOtherCommands = 'Можешь воспользоваться другими командами :)'
export const unsubscribedSuccessfully = 'Успешная отписка 👍'
